gcc -g p5original.c
 ./a.out
Enter a number:
16
Enter a number:
12
The gcd of 16 and 12 is 4
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x865: file p5original.c, line 41.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p5original.c:41
41    n1 = input();
(gdb) n
Enter a number:
12
42    n2 = input();
(gdb) n
Enter a number:
10
43    int res = gcd(n1, n2);
(gdb) n
44    output(n1, n2, res);
(gdb) s
output (a=12, b=10, gcd=2) at p5original.c:35
35    printf("The gcd of %d and %d is %d\n", a, b, gcd);
(gdb) p a
$1 = 12
(gdb) p b
$2 = 10
(gdb) p gcd
$3 = 2
(gdb) n
The gcd of 12 and 10 is 2
36  }
(gdb) n
main () at p5original.c:45
45    return 0;
(gdb) 
